000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SIMPLE CALCULATOR.
000300* --- Это пустая строчка. ---
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000510 WORKING-STORAGE SECTION.
000520 01 WS-A	     PIC 999.
000530 01 WS-B        PIC 9(3).
000540 01 WS-RESULT   PIC 9(6).
000600 PROCEDURE DIVISION.
000700 BEGIN.
000800    DISPLAY “Hello I'm your new calculator!”.
000900    DISPLAY “Please Enter first number from 0 to 999”.
001000    ACCEPT WS-A.
001100    DISPLAY “Please Enter second number from 0 to 999”.
001200    ACCEPT WS-B.
001300    DISPLAY “------------------------------------”.
001400    DISPLAY “ “.
001500    DISPLAY “Your results are:”.
001600    ADD WS-A TO WS-B GIVING WS-RESULT.
001700    DISPLAY “Summ is: ”, WS-RESULT.
001800    SUBTRACT WS-A FROM WS-B GIVING WS-RESULT.
001900    DISPLAY “Subtract is: ”, WS-RESULT.
002000    MULTIPLY WS-A BY WS-B GIVING WS-RESULT.
002100    DISPLAY “Multiplication is: ”, WS-RESULT.
002200    DIVIDE WS-A BY WS-B GIVING WS-RESULT.
002300    DISPLAY “Divide is: ”, WS-RESULT.
002400    STOP RUN.