000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. VARIABLES-EXAMPLES.
000300 AUTHOR. ME.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700 01 HUMAN-CONTAINER.
000800         05 HUMAN-NAME 	PIC A(30).
000900         05 HUMAN-ADDRESS PIC X(160).
001000 77 SQUARE-METERS   		PIC 9(18).
001100 77 SQUARE-PRICE        	PIC 9(15)V9(2).
001150 77 FLAT-PRICE			PIC 9(15)V9(2).
001200 77 TAX-PERCENT          	PIC 9(2).
001300 77 TAX-SUMM              PIC 9(15)V9(2).
001350 77 NEGATIVE-VALUE		PIC S9(10)V9(6).
001400* --- OOOOMG! ---
001500 77 SQUARE-METERS-OUT    	PIC Z(17)9.
001600 77 SQUARE-PRICE-OUT		PIC Z(14)9.Z(2).
001650 77 FLAT-PRICE-OUT-1		PIC Z(3),Z(3),Z(3),Z(3).9(2).
001660 77 FLAT-PRICE-OUT-2		PIC Z(3)BZ(3)BZ(3)BZ(3).9(2).
001700 77 TAX-PERCENT-OUT		PIC Z(2).
001800 77 TAX-SUMM-OUT			PIC Z(14)9.9(2).
001900 77 NEGATIVE-VALUE-OUT-1	PIC +Z(10).9(6).
002000 77 NEGATIVE-VALUE-OUT-2  PIC -Z(10).*(6).
002100* --------------------------------
002200 PROCEDURE DIVISION.
002300 BEGIN.
002400	DISPLAY "Please enter Name: ".
002500 	ACCEPT HUMAN-NAME.
002550	DISPLAY "Please enter Address: ".
002600	ACCEPT HUMAN-ADDRESS.
002700	DISPLAY "Please enter square meters of flat: ".
002800	ACCEPT SQUARE-METERS.
002900	DISPLAY "Please enter square meter's price: ".
003000	ACCEPT SQUARE-PRICE.
003100	DISPLAY "Please enter percent of tax: ".
003200	ACCEPT TAX-PERCENT.
003300	DISPLAY "Enter any really big NEGATIVE value: ".
003400	ACCEPT NEGATIVE-VALUE.
003500	DISPLAY "---------------------------------------".
003600	DISPLAY " ".
003700	DISPLAY HUMAN-NAME.
003800	DISPLAY HUMAN-ADDRESS.
003900	DISPLAY "SQUARE-METERS: ", SQUARE-METERS.
004000	MOVE SQUARE-METERS TO SQUARE-METERS-OUT.
004100	DISPLAY "SQUARE-METERS-OUT: ", SQUARE-METERS-OUT.
004200	DISPLAY "SQUARE-PRICE: ", SQUARE-PRICE.
004300	MOVE SQUARE-PRICE TO SQUARE-PRICE-OUT.
004400	DISPLAY "SQUARE-PRICE-OUT: ", SQUARE-PRICE-OUT.
004500 	MULTIPLY SQUARE-METERS BY SQUARE-PRICE GIVING FLAT-PRICE.
004600	DISPLAY "FLAT-PRICE: ", FLAT-PRICE.
004700	MOVE FLAT-PRICE TO FLAT-PRICE-OUT-1 FLAT-PRICE-OUT-2.
004800	DISPLAY "FLAT-PRICE-OUT-1: ", FLAT-PRICE-OUT-1.
004850	DISPLAY "FLAT-PRICE-OUT-2: ", FLAT-PRICE-OUT-2.
004900	DISPLAY "TAX-PERCENT: ", TAX-PERCENT.
005000	MOVE TAX-PERCENT TO TAX-PERCENT-OUT.
005100	DISPLAY "TAX-PERCENT-OUT: ", TAX-PERCENT-OUT.
005200	DISPLAY "TAX-SUMM: ", TAX-SUMM.
005300	MOVE TAX-SUMM TO TAX-SUMM-OUT.
005400	DISPLAY "TAX-SUMM-OUT: ", TAX-SUMM-OUT.
005500	DISPLAY "NEGATIVE-VALUE: ", NEGATIVE-VALUE.
005600	MOVE NEGATIVE-VALUE TO NEGATIVE-VALUE-OUT-1 NEGATIVE-VALUE-OUT-2.
005700	DISPLAY "NEGATIVE-VALUE-OUT-1: ", NEGATIVE-VALUE-OUT-1.
005800	DISPLAY "NEGATIVE-VALUE-OUT-2: ", NEGATIVE-VALUE-OUT-2.
005900	STOP RUN.